9/data/attachments/600325a59cc6b1b2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:username>
            <nif:friendToBeAdded>Marcus_what_Friend_55013_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>